
// Вот некоторые из наиболее распространенных событий JavaScript:

// click: Событие происходит при клике на элементе.

// mouseover: Событие происходит, когда курсор мыши перемещается на элемент.

// mouseout: Событие происходит, когда курсор мыши покидает элемент.

// keydown: Событие происходит, когда клавиша клавиатуры нажата.

// keyup: Событие происходит, когда клавиша клавиатуры отпущена.

// mouseenter: Событие происходит, когда курсор мыши входит в элемент.

// mouseleave: Событие происходит, когда курсор мыши покидает элемент.

// submit: Событие происходит при отправке формы.

// change: Событие происходит, когда элемент изменяется (например, при изменении значения input или выборе в выпадающем списке).

// load: Событие происходит, когда загружается весь контент страницы или элемента.

// scroll: Событие происходит, когда пользователь прокручивает содержимое элемента.

// resize: Событие происходит, когда размер окна браузера изменяется.